In [1]:
import pandas as pd
import sqlite3 
orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [2]:
users = pd.read_json("users.json")
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [11]:
conn = sqlite3.connect(":memory:")

with open("restaurants.sql", "r") as f:
    conn.executescript(f.read())

restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [12]:
df = orders.merge(users, on="user_id", how="left") \
           .merge(restaurants, on="restaurant_id", how="left")

df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [13]:
df["user_id"].nunique()

2883

In [15]:
import os
os.listdir()

['-1.14-windows.xml',
 '.android',
 '.bash_history',
 '.config',
 '.eclipse',
 '.gitconfig',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.lesshst',
 '.node_repl_history',
 '.opera',
 '.p2',
 '.th-client',
 '.VirtualBox',
 '.vscode',
 'AppData',
 'Application Data',
 'Contacts',
 'Cookies',
 'Documents',
 'Downloads',
 'eclipse',
 'eclipse-workspace',
 'eclipse-workspace1',
 'Favorites',
 'final_food_delivery_dataset.csv',
 'food.html',
 'HTML tutorial',
 'Links',
 'Local Settings',
 'Music',
 'My Documents',
 'NetHood',
 'New folder',
 'node_modules',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{2ad838bc-efea-11ee-a54d-000d3a94eaa1}.TM.blf',
 'NTUSER.DAT{2ad838bc-efea-11ee-a54d-000d3a94eaa1}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{2ad838bc-efea-11ee-a54d-000d3a94eaa1}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'OneDrive',
 'orders.csv',
 'package-lock.json',
 'package.json',
 'Pictures',
 'pinterest-clone',
 'Postman',
 'PrintHood',
 'Recent',
 'restaurants.db',
 'restaurants.sql',
 'Saved Games',
 'Searches',
 'SendTo',
 'Start Menu',
 'Templates',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'users.json',
 'veni.html',
 'Videos',
 'VirtualBox VMs']

In [21]:
df[df["membership"] == "Gold"] \
  .groupby("city")["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [22]:
df.groupby("cuisine")["total_amount"] \
  .mean() \
  .sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [23]:
user_spend = df.groupby("user_id")["total_amount"].sum()

user_spend[user_spend > 1000].count()

np.int64(2544)

In [24]:
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"]

df["rating_range"] = pd.cut(df["rating"], bins=bins, labels=labels, include_lowest=True)

df.groupby("rating_range")["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

rating_range
4.6–5.0    2197030.75
3.0–3.5    2136772.70
4.1–4.5    1960326.26
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [25]:
df[df["membership"] == "Gold"] \
  .groupby("city")["total_amount"] \
  .mean() \
  .sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [26]:
df.groupby("cuisine")["restaurant_id"] \
  .nunique() \
  .sort_values()

cuisine
Chinese    120
Indian     126
Italian    126
Mexican    128
Name: restaurant_id, dtype: int64

In [27]:
df.groupby("cuisine")["total_amount"].sum()

cuisine
Chinese    1930504.65
Indian     1971412.58
Italian    2024203.80
Mexican    2085503.09
Name: total_amount, dtype: float64

In [28]:
gold_pct = (
    df[df["membership"] == "Gold"].shape[0] / df.shape[0]
) * 100

round(gold_pct)

50

In [29]:
restaurant_stats = df.groupby("restaurant_name_x").agg(
    avg_order_value=("total_amount", "mean"),
    total_orders=("order_id", "count")
)

restaurant_stats[
    restaurant_stats["total_orders"] < 20
].sort_values("avg_order_value", ascending=False)

                                   avg_order_value  total_orders
restaurant_name_x
Hotel Dhaba Multicuisine               1040.222308            13
Sri Mess Punjabi                       1029.180833            12
Ruchi Biryani Punjabi                  1002.140625            16
Sri Delights Pure Veg                   989.467222            18
Classic Kitchen Family Restaurant       973.167895            19
...                                            ...           ...
Annapurna Tiffins Punjabi               621.828947            19
Darbar Tiffins Non-Veg                  596.815556            18
Darbar Restaurant Punjabi               589.972857            14
Spice Tiffins Pure Veg                  578.578667            15
Ruchi Mess Punjabi                      572.686471            17

[170 rows x 2 columns]

In [30]:
df.groupby(["membership", "cuisine"])["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [32]:
df["order_date"] = pd.to_datetime(df["order_date"], dayfirst=True)

In [33]:
df["quarter"] = df["order_date"].dt.quarter

df.groupby("quarter")["total_amount"] \
  .sum() \
  .sort_values(ascending=False)

quarter
3    2037385.10
4    2018263.66
1    2010626.64
2    1945348.72
Name: total_amount, dtype: float64

In [34]:
print("Join column (orders ↔ users):", "user_id")

Join column (orders ↔ users): user_id

In [35]:
print("Cuisine & rating dataset format:", "SQL")

Cuisine & rating dataset format: SQL

In [36]:
df.shape[0]

10000

In [37]:
print("Missing merge values appear as:", df.isna().any().idxmax())
print("Actual missing value representation:", type(df.isna().iloc[0,0]))

Missing merge values appear as: order_id
Actual missing value representation: <class 'numpy.bool'>

In [38]:
print("Pandas function used for joins:", "merge()")

Pandas function used for joins: merge()

In [39]:
print("membership column source:", "users.json")

membership column source: users.json

In [40]:
print("Join key (orders ↔ restaurants):", "restaurant_id")

Join key (orders ↔ restaurants): restaurant_id

In [41]:
[col for col in df.columns if "cuisine" in col.lower()]

['cuisine']

In [42]:
df.groupby("user_id").size().max()

np.int64(13)

In [43]:
df[df["membership"] == "Gold"].shape[0]

4987

In [44]:
round(
    df[df["city"] == "Hyderabad"]["total_amount"].sum()
)

1889367

In [45]:
df["user_id"].nunique()

2883

In [46]:
round(
    df[df["membership"] == "Gold"]["total_amount"].mean(),
    2
)

np.float64(797.15)

In [47]:
df[df["rating"] >= 4.5].shape[0]

3374

In [49]:
gold_df = df[df["membership"] == "Gold"]

top_city = gold_df.groupby("city")["total_amount"].sum().idxmax()

gold_df[gold_df["city"] == top_city].shape[0]

1337